#### Cluster ☸️ `Development`

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cluster-core.module.gke.google_container_node_pool.pools["default-node-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "projects/rkgke-dev-03/locations/europe-west2/clusters/karamba-dev/nodePools/default-node-pool" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/rkgke-dev-03/zones/europe-west2-a/instanceGroupManagers/gke-karamba-dev-default-node-pool-9e4f2303-grp",
          - "https://www.googleapis.com/compute/v1/projects/rkgke-dev-03/zones/europe-west2-b/instanceGroupManagers/gke-karamba-dev-default-node-pool-8909afe8-grp",
          - "https://www.googleapis.com/compute/v1/projects/rkgke-dev-03/zones/europe-west2-c/instanceGroupManagers/gke-karamba-dev-default-node-pool-39e08f78-grp",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "default-node-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 1 -> (known after apply)
      ~ node_locations      = [
          - "europe-west2-a",
          - "europe-west2-b",
          - "europe-west2-c",
        ] -> (known after apply)
      + operation           = (known after apply)
      ~ version             = "1.18.16-gke.302" -> (known after apply)
        # (4 unchanged attributes hidden)



      ~ node_config {
          ~ disk_size_gb      = 10 -> 20 # forces replacement
            tags              = [
                "gke-karamba-dev",
                "gke-karamba-dev-default-node-pool",
                "load-balanced-backend",
                "default-node-pool",
            ]
            # (12 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Resource targeting is in effect

You are creating a plan with the -target option, which means that the result
of this plan may not represent all of the changes requested by the current
configuration.
		
The -target option is not for routine use, and is provided only for
exceptional situations such as recovering from errors or mistakes, or when
Terraform specifically suggests to use it as part of an error message.
```

</details>

*Pusher: @kupson, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*